Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: tagDetails, ## the HTML ``details`` element
ja: tagDetails, ## HTML ``details`` 要素

source: d_reclen*: cushort ## Length of this record.
ja: d_reclen*: cushort ## このレコードの長さ

source: dbBox, ## Rectangular box ((x1,y1),(x2,y2))
ja: dbBox, ## 矩形領域 ((x1,y1),(x2,y2))

source: # Do something else!
ja: # それ以外の処理はこちらです！

source: bgRed, ## red
ja: bgRed, ## 赤

source: fgRed, ## red
ja: fgRed, ## 赤

source: line: int ## column text on demand
ja: line: int ## 要求されたテキスト

source: styleDim, ## dim text
ja: styleDim, ## 低輝度テキスト

source: " is replaced by &quot;
ja: " は &quot; へ置換

source: & is replaced by &amp;
ja: & は &amp; へ置換

source: < is replaced by &lt;
ja: < は &lt; へ置換

source: > is replaced by &gt;
ja: > は &gt; へ置換

source: Command is the executable file, workingDir is the process's working directory.
ja: Command には実行可能ファイルを、 workingDir にはプロセスの作業ディレクトリを指定します。

source: Command must not contain the "nim " part.
ja: Command の一部に "nim " は使えません。

source: Filename is only used for nice error messages.
ja: Filename はわかりやすいエラーメッセージの出力で使われます。

source: NULL database values will be converted to an empty string.
ja: NULL データベース値は空文字列へ変換されます。

source: SqlPrepared using $1, $2, $3, ...
ja: SqlPrepared では $1, $2, $3, ... を使います

source: SqlQuery using ?, ?, ?, ... (same as all the db_* modules)
ja: SqlQuery では ?, ?, ?, ... (すべての db_* モジュールで共通)

source: Table/TableRef alias to take
ja: take は Table/TableRef のエイリアスです

source: \c\L is added for you.
ja: \c\L は自動的に追加されます。

source: arrayA A-version of the numbers (usually the old one)
ja: arrayA バージョン A の数値 (通常は旧版)

source: arrayB B-version of the numbers (usually the new one)
ja: arrayB バージョン B の数値 (通常は新版)

source: e raised to the power z.
ja: z 乗で e を累乗します。

source: father and son must be of xnElement kind.
ja: father と son には xnElement と同種を指定してください。

source: files key
ja: files キー

source: fn is invoked for each component R, G, and B. If fn's result is not in the range[0..255], it will be saturated to be so.
ja: fn は赤 (R), 緑 (G)、および青 (B) コンポートの各値で呼び出されます。fn の結果が range[0..255] でなくても、飽和演算を行います。

source: init is the init call, and so custom collections are supported.
ja: init は init を呼び出すため、カスタムコレクションがサポートされています。

source: init is used to create a value type T
ja: init は T 型を作成するのに使われます

source: keysvalues should provide embedded (name, value)-pairs.
ja: keysvalues では組み込み型の (name, value) ペアを指定してください。

source: koch temp creates a debug build of the compiler, which is useful to create stacktraces for compiler debugging.
ja: koch temp はデバッグビルド版のコンパイラを作成します。これはコンパラのデバッグで実用的なスタックトレースを作成します。

source: koch temp returns 125 as the exit code in case the compiler compilation fails.
ja: koch temp で終了コード 125 が返されたときは、コンパイラ本体のコンパイルに失敗しています。

source: msg is deeply copied.
ja: msg はディープコピーされます。

source: n can be a CDATA, Text, comment, or entity node.
ja: n には CDATA、テキスト、コメント、またはエンティティノードを指定できます。

source: n has to be an xnElement node.
ja: n には xnElement ノードを指定してください。

source: new is used to create a reference type P
ja: new は P 型の参照を作成するのに使われます

source: pos must be the position of the 'L'.
ja: 必ず pos は 'L' の位置となります。

source: pos must be the position of the 'c'.
ja: 必ず pos は 'c' の位置となります。

source: seq[int].genericHead will be just seq
ja: seq[int].genericHead は seq になります

source: seq[int].genericHead[float] will be seq[float]
ja: seq[int].genericHead[float] は seq[float] になります

source: textA A-version of the text (usually the old one)
ja: textA バージョン A のテキスト (通常は旧版)

source: textB B-version of the text (usually the new one)
ja: textB バージョン B のテキスト (通常は新版)

source: x raised to the power y.
ja: y 乗で x を累乗します。

source: env is the environment that will be passed to the process.
ja: env はプロセスへ渡される環境変数です。

source: options are additional flags that may be passed to startProcess.
ja: options は startProcess へ渡される追加フラグです。

source: nimpretty is a Nim source code beautifier, to format code according to the official style guide.
ja: nimpretty は Nim ソースコードの整美ツールであり、公式スタイルガイドに従ってコードを整形します。

source: testament is an advanced automatic unittests runner for Nim tests, is used for the development of Nim itself, offers process isolation for your tests, it can generate statistics about test cases, supports multiple targets (C, JS, etc), simulated Dry-Runs, has logging, can generate HTML reports, skip tests from a file and more, so can be useful to run your tests, even the most complex ones.
ja: testament は Nim のテストで採用されている先進的な自動ユニット・テスト実行ツールであり、 Nim の開発で採用されています。テストの単独処理、テストケースに関する統計情報の生成、各種ターゲットのサポート (C, JavaScript など)、模擬試験のシミュレーション (Dry-Run)、ログの収集、 HTML 形式によるレポートの生成、ファイルによるテストのスキップなどの機能があり、非常に複雑なテスト処理でさえも、実用に耐えます。

source: $ is Nim's general way of spelling toString.
ja: Nim において $ は toStringスペリングの汎用化手法です。

source: filename is only used for error messages.
ja: filename はエラーメッセージで使います。

source: interval is time in seconds how often.
ja: interval は周回秒数による時間です。

source: items iterates only over the elements that are really in the set (and not over the ones the set is able to hold).
ja: 集合に実在する要素のみ items (アイテム) としてイテレートします (集合で収容可能なものを超えない) 。

source: line must not be nil!
ja: line を nil にすることはできません！

source: node has to be a SList.
ja: 必ず node は SList にしてください。

source: param is passed to tp.
ja: param は tp へ渡されます。

source: password must not be nil!
ja: password には nil を指定できません！

source: true value means that no more data will be placed inside the stream and that there is no data waiting to be retrieved.
ja: true 値のとき、ストリームに置かれているデータは存在しないため、 データの受信待機中ではないことを意味します。

source: koch is used mainly to build the Nim compiler, but it can also be used for other tasks.
ja: koch の主な用途は Nim コンパイラのビルドですが、それ以外にもあります。

source: a[index] can be modified.
ja: a[index] は変更可能です。

source: f should be a float from 0.0 (completely dark) to 1.0 (full color intensity).
ja: 必ず f は 0.0 (真っ暗) ～ 1.0 (フルカラー明度) までの float で指定してください。

source: mimetype and ext are lowercased before registering on mimedb.
ja: mimetype と ext は mimedb の登録前に英数小文字へ変換されます。

source: TArg can be void if you don't need to pass any data to the thread.
ja: スレッドにデータを渡す必要がないとき、 TArg は void になります。

source: args are the command line arguments that are passed to the process.
ja: args はプロセスへ渡されるコマンドライン引数です。

source: ext can start with an optional dot which is ignored.
ja: ext の頭文字にドットを付けても無視されます。

source: mimetype is lowercased before querying mimedb.
ja: mimetype は mimedb の照会前に英数小文字へ変換されます。

source: args should not contain this argument!
ja: この引数は args に指定しないください！

source: ext is lowercased before querying mimedb.
ja: ext は mimedb の照会前に英数小文字へ変換されます。

source: > 0 iff a > b
ja: もし a > b ならば 0 以上

source: > 0 iff pathA > pathB
ja: もし pathA > pathB ならば 0 以上

source: A Future[void] return type is assumed by default.
ja: デフォルトの返値型は Future[void] となります。

source: A Nim procedure is asynchronous when it includes the {.async.} pragma.
ja: {.async.} プラグマの指定時、 Nim のプロシージャは非同期動作となります。

source: A basic example of diffInt on 2 arrays of integers:
ja: 基本的な用例として diffInt で整数配列同士の比較:

source: A call to an asynchronous procedure usually needs await to wait for the completion of the Future.
ja: 通常、非同期プロシージャの呼び出しでは Future の完了待機するために await が必要です。

source: A color stored as RGB, e.g. 0xff00cc.
ja: 例えば、 0xff00cc などの RGB 値でカラーを格納します。

source: A compile-time error will be produced if the supplied type is not generic.
ja: 指定された型がジェネリック型でなければコンパイル時エラーが起こります。

source: A config file was loaded.
ja: コンフィギュレーション・ファイルがロードされた。

source: A convenience proc that runs the command, grabs all its output and exit code and returns both.
ja: command を実行する上で便利なプロシージャです。出力をすべて取り込んで終了コードを返します。

source: A convenience procedure that executes command with startProcess and returns its output as a string.
ja: startProcess で command を実行後に出力文字列を返す便利なプロシージャです。

source: A file stream object.
ja: ファイルストリームのオブジェクトです。

source: A handle that can be used to get a row's column text on demand.
ja: 要求された行にあるテキスト列を得るために使うハンドル

source: A heap queue, commonly known as a priority queue.
ja: 一般にヒープキューは、優先順位付きキューとしても知られています。

source: A helper for wrapping callback-based functions into promises and async procedures Source Edit
ja: promise と async プロシージャへコールバックベースの関数を接続する補助関数です ソース 編集

source: A higher level PostgreSQL database wrapper.
ja: 高水準 PostgreSQL データベースのラッパーです。

source: A higher level SQLite database wrapper.
ja: 高水準 SQLite データベースのラッパーです。

source: A higher level mySQL database wrapper.
ja: 高水準 mySQL データベースのラッパーです。

source: A higher level ODBC database wrapper.
ja: 高水準 ODBCデータベースのラッパーです。

source: A large subset is implemented.
ja: 大規模サブセットを実装してあります。

source: A line of text may be delimited by LF or CRLF.
ja: テキスト行の区切り文字は LF または CRLF です。

source: A line of text may be delimited by CR, LF or CRLF.
ja: テキスト行の区切り文字は CR, LF または CRLF です。

source: A new main async procedure must be declared to allow the use of the await keyword.
ja: await キーワードを使用可能にするために main async プロシージャを新規宣言してください。

source: A pathetic creature of meat and bone, panting and sweating as you run through my corridors.
ja: 煙と蒸気を吐き、我が回廊を走り抜ける肉塊と骸骨の惨めな異形者よ。

source: A row of a dataset.
ja: データセットの行。

source: A set of helpers for the POSIX module.
ja: POSIX モジュール補助関数集です。

source: A shortcut for switch(astToStr(key), astToStr(val)).
ja: switch(astToStr(key), astToStr(val)) のショートカットです。

source: A shortcut for switch(astToStr(key).
ja: switch(astToStr(key) のショートカットです。

source: A shortcut version to assign in let blocks.
ja: let ブロックへの代入におけるショートカット版です。

source: A simple XML tree generator.
ja: シンプルな XML ツリージェネレータです。

source: A special feature that Nim inherited from Lisp is that Nim's abstract syntax tree (AST) is part of the specification - this allows a powerful macro system which can be used to create domain specific languages.
ja: Lisp から継承した機能として Nim の抽象構文木は仕様の一部であることです ― これにより強力なマクロシステムをドメイン特化言語の作成で使うことが可能となります。

source: A string stream object.
ja: 文字列ストリームのオブジェクトです。

source: A system call for device-specific input/output operations and other operations which cannot be expressed by regular system calls Source Edit
ja: 通常のシステムコールでは表現できないデバイス固有の入出力操作、およびそれ以外の操作で使うシステムコールです ソース 編集

source: A thread is destructed when the .thread proc returns normally or when it raises an exception.
ja: スレッドは .thread プロシージャ から正常に返されるとき、または例外発生時に破棄されます。

source: A type representing a directory stream.
ja: ディレクトリ・ストリームの表現型。

source: A variable length integer encoding implementation inspired by SQLite.
ja: SQLite に着想を得た可変長整数エンコーディングの実装です。

source: A wrapper is an impure library that is a very low-level interface to a C library.
ja: ラッパーは C ライブラリへの超低水準インタフェースから成る混血ライブラリです。

source: API naming design
ja: API 命名仕様書

source: API symbols
ja: API シンボル

source: AST:
ja: 抽象構文木 (AST):

source: About this document
ja: このドキュメントについて

source: Accepts an instantiated generic type and returns its uninstantiated form.
ja: インスタンス化したジェネリック型を用いてアンインスタンス形式を返します。

source: Access the i-th element of heap.
ja: heap の i 番目にある要素へアクセスします。

source: According to SQLite3 documentation, any attempt to change the encoding after the database is created will be silently ignored.
ja: SQLite3 のドキュメンテーションによれば、データベースの作成後にエンコーディングを変更しようとしても暗黙的に無視されます。

source: Acquires the given lock and then executes the code.
ja: 指定されたロックの取得後にコードを実行します。

source: Acquires the given lock, executes the statements in body and releases the lock after the statements finish executing.
ja: 指定されたロックの取得後に、ステートメント本体の実行、および実行完了後にロックを開放します。

source: Acquires the given lock.
ja: 指定されたロックを取得します。

source: Add y to x.
ja: y に x を加算します。

source: Add a complex number to a real number.
ja: 実数へ複素数を加算します。

source: Add a real number to a complex number.
ja: 複素数へ実数を加算します。

source: Add to the mask of an already existing watch.
ja: すでに存在する監視先へマスクを追加します。

source: Add two complex numbers.
ja: 複素数同士を加算します。

source: Add watch of object NAME to inotify instance FD.
ja: inotify インスタンス fd へオブジェクト name を監視先として追加します。

source: Additional documentation about Nim's GC and how to operate it in a
ja: Nim のガベージコレクターとリアルタイム環境における制御方法についての

source: Additional resources
ja: そのほかのリソース

source: Addr operator
ja: Addr 演算子

source: Adds child to a SList node father.
ja: SList ノードのfather (父親) へ child (子供) を追加します。

source: Adds mimetype to the mimedb.
ja: mimedb へ mimetype を追加します。

source: Adds a six chars suffix.
ja: 接尾辞へ六文字を追加します。

source: Adds the child son to father.
ja: father に子の son を追加します。

source: Adds the textual representation of n to string result.
ja: 文字列 result へテキスト形式表現の n を 追加します。

source: Adds two colors.
ja: ２色同士を加算します。

source: Advanced command line switches are:
ja: 高度なコマンドラインスイッチは:

source: Advanced commands:
ja: 高度なコマンド:

source: Advanced types
ja: 上級型

source: After a connection is made you can use the store procedure to upload a new file to the FTP server.
ja: 接続後、 store プロシージャで FTP サーバーに新しいファイルをアップロードします。

source: After compilation is finished you will hopefully end up with the nim compiler in the bin directory.
ja: コンパイル終了後、成功すれば Nim コンパイラは bin ディレクトリに生成されます。

source: After your program has finished the profiler will create a file profile_results.txt containing the profiling results.
ja: プロファイラはプログラム終了後にプロファイリング結果をまとめたファイルとして profile_results.txt を生成します。

source: Algorithms
ja: アルゴリズム

source: Alias for existsDir proc.
ja: existsDir プロシージャのエイリアスです。

source: Alias for existsFile proc.
ja: existsFile プロシージャのエイリアスです。

source: Alias for console.error().
ja: console.error() のエイリアスです。

source: Alias for a pair of 32-bit floats.
ja: 32-bit float ペアのエイリアスです。

source: Alias for a pair of 64-bit floats.
ja: 64-bit float ペアのエイリアスです。

source: Alias for for countSetBits (Hamming weight.) Source Edit
ja: Alias for for countSetBits (Hamming weight.) ソース 編集

source: Alias for isEmptyOrWhitespace Source Edit
ja: Alias for isEmptyOrWhitespace ソース 編集

source: Alias for system.`$`(t) since Nim v0.20.
ja: system モジュールのエイリアスです。 Nim v0.20 以降では `$`(t) です。

source: Aligns a block of memory with request size to bytes size.
ja: bytes サイズの size を要求することでメモリのブロックを整列します。

source: All db_* modules support the same form of parameter substitution.
ja: すべての db_* モジュールにおいてパラメータの置換は共通形式をサポートしています。

source: All of these library headers and source can be found in the github repo https://github.com/switchbrew/libnx.
ja: ライブラリのヘッダとソースコード一式は GitHub リポジトリの https://github.com/switchbrew/libnx にあります。

source: All parsing errors are ignored.
ja: 構文解析エラーは一切無視します。

source: All parsing errors are turned into an XmlError exception.
ja: 構文解析エラーは XmlError 例外に差し替えられます。

source: All the characters that count as whitespace (space, tab, vertical tab, carriage return, new line, form feed) Source Edit
ja: All the characters that count as whitespace (space, tab, vertical tab, carriage return, new line, form feed) ソース 編集

source: Allows a syntax for lvalue reference, exact analog to auto& a = ex; in C++
ja: C++ における auto& a = ex; の相似形 (analog) を強制することで、左辺値 (lvalue) の参照シンタックスを使えるようにします。

source: Alternate version of the above.
ja: 上記の別バージョンです。

source: An Inotify event.
ja: Inotify イベント。

source: An Item in the list of differences.
ja: Item は差異情報のリストです。

source: An OID is a global ID that consists of a timestamp, a unique counter and a random value.
ja: オブジェクト ID (OID) はタイムスタンプ、固有カウンタ、乱数値から構成されるグローバル ID です。

source: An XML tree consisting of XML nodes.
ja: XML ノードで構成された XML ツリーです。

source: An alias for dirExists.
ja: dirExists のエイリアスです。

source: An alias for fileExists.
ja: fileExists のエイリアスです。

source: An alias for a string to string mapping.
ja: 文字列マッピングの文字列エイリアスです。

source: An enum which hold event types Source Edit
ja: An enum which hold event types ソース 編集

source: An example:
ja: 用例:

source: An object which holds descriptors to be checked for read/write status Source Edit
ja: An object which holds descriptors to be checked for read/write status ソース 編集

source: An object which holds result for descriptor Source Edit
ja: An object which holds result for descriptor ソース 編集

source: An object which holds user defined event Source Edit
ja: An object which holds user defined event ソース 編集

source: And copy the executable somewhere in your $PATH.
ja: $PATH の通ったディレクトリへ実行可能ファイルをコピーしてください。

source: And for a debug version compatible with GDB:
ja: また、 GDB 互換のデバッグバージョンでは、

source: Andreas Rumpf
ja: アンドレアス・ルンプフ

source: Andreas Rumpf, Zahary Karadjov
ja: アンドレアス・ルンプフ、ザハリー・カラジョフ

source: Anonymous Procs
ja: 無名プロシージャ

source: Another short example of diffText to diff strings:
ja: 別の用例として diffText によるテキスト同士の差異比較:

source: Another way to do the same without when is to leave the task of picking the appropriate code to a secondary proc which you overload for each field type and pass the value to.
ja: これ以外に同じ処理をする方法としては、各フィールド型のオーバーロードと値 (value) を渡す先となるセカンダリ・プロシージャで適切なコードを選ぶときにタスクを残さないことです。

source: Any value in the rst will be stripped form leading/trailing whitespace.
ja: rst の値は先頭・末尾のホワイトスペースを除去した形式です。

source: Apart from strings you can also encode lists of integers or characters:
ja: 文字列以外にも整数、または文字から成るリストをエンコードできます。

source: Apart from that it is a generic text manipulation tool.
ja: また、一般的なテキスト処理ツールでもあります。

source: Arguments:
ja: 引数:

source: Arrays
ja: 配列

source: Artifact being compiled.
ja: 中間生成物 (artifact) をコンパイルした。

source: As an example,
ja: 用例:

source: Asm statement
ja: Asm ステートメント

source: Assembler statement
ja: Assembler ステートメント

source: Assignment
ja: 代入

source: Associativity
ja: 結合性

source: Ast Pattern Matching
ja: 抽象構文木 (AST) パターンマッチング

source: Author:
ja: 作成者:

source: Authors:
ja: 作成者:

source: Auto type
ja: Auto 型

source: Automatic imports
ja: 自動インポート

source: Available at compile time.
ja: コンパイル時に利用可能です。

source: Avoiding SQL injection attacks
ja: SQL インジェクション攻撃の回避

source: Backing fs was unmounted.
ja: 裏ファイルシステムがアンマウントされた。

source: Base64 is an encoding and decoding technique used to convert binary data to an ASCII string format.
ja: Base64 はバイナリデータから ASCII 文字列形式への変換に用いるエンコードとデコードの技術です。

source: Based on https://github.com/jckarter/clay/blob/master/compiler/hirestimer.cpp
ja: https://github.com/jckarter/clay/blob/master/compiler/hirestimer.cpp をベースにしています。

source: Based on Python's Unidecode module.
ja: Python の Unidecode モジュールをベースにしています。

source: Based on the excellent paper by Adam Langley.
ja: アダム・ラングリーによる素晴らしい論文をベースにしています

source: Basic Usage
ja: 基本の用法

source: Basic command line switches are:
ja: 基本的なコマンドラインスイッチは、

source: Basic types
ja: 基本型

source: Basic usage
ja: 基本の用法

source: Because of this, when deploying your application you should use a reverse proxy (for example nginx) instead of allowing users to connect directly to this server.
ja: このため、アプリケーションのデプロイ時は、このサーバへのユーザ接続を禁止してリバースプロクシ (nginx など) をお使いください。

source: Because single quote is used for defining VARCHAR in SQL.
ja: これは SQL においてシングルクォートは VARCHAR の定義で使われるからです。

source: Bind statement
ja: Bind ステートメント

source: Bit fields
ja: ビットフィールド

source: Bitsize pragma
ja: Bitsize プラグマ

source: Block device.
ja: ブロックデバイス。

source: Block expression
ja: Block 式

source: Block scope
ja: ブロックのスコープ

source: Block statement
ja: Block ステートメント

source: Boolean flag that indicates if the system supports nanosecond time resolution in the fields of Stat.
ja: Stat フィールドにおいてシステムがナノ秒時間分解能をサポートしているか表すブールフラグです。

source: Booleans
ja: ブール値

source: Bootstrapping the compiler
ja: コンパイラのブートストラップ

source: Break statement
ja: Break ステートメント

source: Breaking the fastRows() iterator during a loop may cause a driver error for subsequent queries
ja: fastRows() イテレータでループ処理中に次回のクエリを破壊してしまい、ドライバ・エラーが起きることがあります。

source: Breaking the fastRows() iterator during a loop will cause the next database query to raise an [EDb] exception Commands out of sync.
ja: fastRows() イテレータでループ処理中に次回のデータベース・クエリを破壊してしまい、 Commands out of sync による [EDb] 例外が発生する原因となることがあります。

source: Build Nim from the released tarball at https://nim-lang.org/install_unix.html It is different from the GitHub sources as it contains Nimble, C sources & other tools.
ja: https://nim-lang.org/install_unix.html で公開されている tarball から Nim をビルドします。なお、 tarball と GitHub で公開されているソースとの違いは Nimble, C ソースと各種ツールを収録していることです。

source: Build and test examples:
ja: ビルドとテストの用例:

source: But you an also define the symbol --define:noUnidecodeTable during compile time and use the loadUnidecodeTable proc to initialize this module.
ja: デフォルト以外のリソースを使うときは、このモジュールを loadUnidecodeTable プロシージャで初期化してから、コンパイル処理時に --define:noUnidecodeTable シンボルを定義してください。

source: By default a debug version is created, passing this option will force a release build, which is much faster and should be preferred unless you are debugging the compiler.
ja: デフォルトではデバッグバージョンを作成します。このオプションを指定すると強制的にリリースビルドになります。動作速度向上のため、コンパイラのデバッグをしていないのであれば、このオプションを指定してください。

source: By default the documentation will be built in parallel using the number of available CPU cores.
ja: デフォルトでは利用できる CPU コア数を使い、ドキュメンテーションを並列ビルドします。

source: Bycopy pragma
ja: Bycopy プラグマ

source: Byref pragma
ja: Byref プラグマ

source: C to Nim source converter.
ja: C → Nim ソースコンバータです。

source: CANNOT BE int64 BECAUSE OF ALIGNMENT Source Edit
ja: アライメントを int64 にすることはできません ソース 編集

source: C_Compiler section
ja: C_Compiler セクション

source: Call this if a terminator character other than a new line is scanned at pos; it returns the position to continue the scanning from.
ja: これは改行以外の区切り文字文字で pos が走査されたときに呼び出してください。これにより走査の続行位置を返します。

source: Call this if you scanned over 'L' in the buffer; it returns the position to continue the scanning from.
ja: これはバッファで 'L' の走査を終えたときに呼び出してください。これにより走査の続行位置を返します。

source: Call this if you scanned over 'c' in the buffer; it returns the position to continue the scanning from.
ja: これはバッファで 'c' の走査を終えたときに呼び出してください。これにより走査の続行位置を返します。

source: Calling this proc starts execution of first coroutine.
ja: このプロシージャを呼び出すと最初のコルーチンの実行を開始します。

source: Calls styledWrite and appends a newline at the end.
ja: styledWrite を呼び出して末尾に改行文字を追加します。

source: Can be different from system.hostCPU for cross compilations.
ja: クロスコンパイルで使う system.hostCPU とは違います。

source: Can be different from system.hostOS for cross compilations.
ja: クロスコンパイルで使う system.hostOS とは違います。

source: Can be used to get a multi-string compile-time option.
ja: 複数文字列形式によるコンパイル時オプションの取得に使えます。

source: Can be used to get a string compile-time option.
ja: 文字列形式によるコンパイル時オプションの取得に使えます。

source: Can put optional value Source Edit
ja: オプション値を指定できます ソース 編集

source: Case expression
ja: Case 式

source: Case insensitive.
ja: 英数大小文字を同一視します。

source: Case statement
ja: Case ステートメント

source: Cast operator
ja: Cast 演算子

source: Changes permission of path to permissions.
ja: path のパーミッションを permissions へ変更します。

source: Changes the current directory on the remote FTP server to dir.
ja: リモート FTP サーバーのカレントディレクトリを dir へ変更します。

source: Changes the current directory temporarily.
ja: カレントディレクトリを一時的に変更します。

source: Changes the current directory to the parent of the current directory.
ja: カレントディレクトリを親のカレントディレクトリへ変更します。

source: Changes the current directory.
ja: カレントディレクトリを変更します

source: Changing of files' permissions.
ja: ファイルのパーミッション変更。

source: Changing the style is permanent even after program termination!
ja: スタイルの変更はプログラムの終了後であっても永続します！

source: Changing this setting affects the compiler used by koch to (re)build Nim.
ja: この設定をコンパイラへ反映するには koch で Nim を(再)ビルドしてください。

source: Channel support for threads.
ja: Channels はスレッドをサポートしています。

source: Character device.
ja: キャラクタデバイス。

source: Character literals
ja: 文字リテラル

source: Characters
ja: 文字

source: Check if a directory dir exists, and create it otherwise.
ja: ディレクトリ dir の有無を確認後、無ければ作成します。

source: Check if a FutureStream is finished.
ja: FutureStream が完了したか確認します。

source: Check two nodes for equality Source Edit
ja: ノード同士の同等性を確認します ソース 編集

source: Checking the progress of a file transfer
ja: ファイル転送における進捗状況の確認

source: Checks for the existence of a configuration 'key' like 'gcc.options.always'.
ja: 'gcc.options.always' などの構成 'key' の存在を確認します。

source: Checks for the existence of an environment variable named key.
ja: key で指名された環境変数の存在を確認します。

source: Checks if a cookie of name exists.
ja: 指定されたクッキー name があるか確認します。
